README.md

# Table of Contents

1.  [Installation](#org6254998)



<a id="org6254998"></a>

# Installation

At the time of writting this, my journey into NixOS and the Nix enviorment is still fairly new, so it is likely
this flake will be unstable and quite a mess and will probably change&#x2026; ****A LOT****. With that said the only
command ideally neaded to be run would be:

    sudo nixos-rebuild switch --impure --flake .

While in the directory of the repo inside of an existing NixOS install.

